# Теперь нужные столбцы данных известны; попробуем прочитать часть этих данных.

from pathlib import Path
import csv

path = Path('weather_data/sitka_weather_07-2021_simple.csv')
lines = path.read_text().splitlines()

reader = csv.reader(lines)
header_row = next(reader)

# Извлечение максимальных температур.
highs = []      # создание списка.
for row in reader:     # перебор остальных строк в файле.
# Объект reader продолжает с того места, на котором он остановился в ходе чтения файла CSV,
# и автоматически возвращает каждую строку после текущей позиции.
# Т.е., заголовок уже прочитан, поэтому цикл продолжается со 2-ой строки, в которой уже есть данные.
    high = int(row[4])    # при каждом проходе цикла значение с индексом 4 (заголовок TMAX) присваивается переменной high.
    # данные потом превращаются в числовой формат, чтобы их можно было использовать в дальнейшем (int).
    highs.append(high)

print(highs)